---
kind: type
id: T:Autodesk.Revit.DB.CombinableElement
source: html/c88bdbbc-dbbb-0817-a358-35f8686f68a2.htm
---
# Autodesk.Revit.DB.CombinableElement

An element that can be added to a geometry combination.

## Syntax (C#)
```csharp
public class CombinableElement : Element
```